'use client'
import styles from '@/modules/about/components/About.module.scss'
import { motion } from 'framer-motion'
import { animation } from '@/constants/animation'

export const TestComponent = () => {
  return (
    <motion.div initial={'hidden'} whileInView={'visible'} viewport={{ once: true, amount: 0.3 }}>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <p>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </p>
      <p className={styles.subtitle}>Здравствуйте! </p>
      <p>С начала 2022 года я занимаюсь разработкой приложений. Пишу на React js и Next js использую TypeScript.</p>
      <p>
        Имею опыт работы в команде в разных проектах, на каждом из которых многому научился. Команды были от 3х до 8
        человек.
      </p>
      <p>
        У меня большой опыт в верстке. С 2016 года занимаюсь разработкой сайтов. Сложно посчитать, но думаю сделал более
        200 сайтов.
      </p>
      <motion.p variants={animation.fadeRightAnimation}>
        К работе отношусь ответственно, вникаю в задачу для меня важен результат. Я рад когда вижу положительную
        обратную связь.
      </motion.p>
    </motion.div>
  )
}
